'''
# =======================================
# SR291 数据集加载器 → 训练集
# =======================================
- 文件作用: 定义 SR291 类，专用于 SR291 数据集的加载。
- 与其他文件关系: 继承自通用基类 SRData。
- SR291: 是经典 SR 训练集（291 张图像），常用于早期模型如 SRCNN、VDSR。
'''
from data import srdata # 引入 SRData 类

'''
# =========================================================================
# 数据集类 SR291, 继承自 data.Dataset
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
* 作用：加载 SR291 数据集。
# =========================================================================
'''
class SR291(srdata.SRData):
    ''' 初始化 SR291 数据集 '''
    # ---------------------------------------------------------------------
    # 作用: 仅仅初始化 SR291 数据集，不作额外处理。
    # 参数: 只传入 args 和数据集名，其他参数使用默认值。
    # 没有重写 _set_filesystem()，因此默认数据结构为：
    #   SR291/
    #    ├── HR/
    #    └── LR_bicubic/
    # ---------------------------------------------------------------------
    def __init__(self, args, name='SR291', train=True, benchmark=False):
        super(SR291, self).__init__(args, name=name)
        